<?php


/*----------------------------------------------------------------------------
 *
 *  猴子选大王
 *
 *----------------------------------------------------------------------------
 *
 *	一群猴子排成一圈，按1，2，...，n依次编号。
 *	然后从第1只开始数，数到第m只,把它踢出圈，从它后面再开始数，再数到第m只，在把它踢出去...，
 *	如此不停的进行下去，直到最后只剩下一只猴子为止，那只猴子就叫做大王。要求编程模拟此过程，
 *	输入m、n,输出最后那个大王的编号。
 *
 * ---------------------------------------------------------------------------
 *
 * 	思路：循环数组判断取出的每一个值是否是m的倍数，如果是剔除掉。如果不是push到数组队尾。
 *
 *  算法复杂度:O(n)
 *
 *----------------------------------------------------------------------------
 */

$n=17;$m=3;
print_r(monkeySelectKing($n,$m));

function monkeySelectKing($n,$m){
    $monkey = range(1,$n);
    $i=0;
    while(count($monkey)>1){
        $i+=1;
        $head = array_shift($monkey);
        if($i % $m !=0){
            //当前取到的这个如果不是m的倍数 就重新放回去
            array_push($monkey,$head);
        }

    }
    return $monkey[0];
}